/* eslint-disable @typescript-eslint/no-loss-of-precision */
interface ICountriesData {
    [key: string]: {
        lat: number;
        lng: number;
        ruName: string;
    };
}

const countries: ICountriesData = {
    "New Zealand": {
        lat: -42.67729802270199,
        lng: 172.12549075181897,
        ruName: "Новая Зеландия",
    },
    Australia: {
        lat: -24.88594896262466,
        lng: 135.62053590824735,
        ruName: "Австралия",
    },
    "Papua New Guinea": {
        lat: -6.4146314088919825,
        lng: 143.9638472384746,
        ruName: "Папуа-Новая Гвинея",
    },
    Indonesia: {
        lat: -4.2456618174420395,
        lng: 122.03156014444416,
        ruName: "Индонезия",
    },
    Philippines: {
        lat: 12.508561125607123,
        lng: 122.86440301796644,
        ruName: "Филиппины",
    },
    Malaysia: {
        lat: 3.772252320328642,
        lng: 102.03758163246707,
        ruName: "Малайзия",
    },
    "Timor-Leste": {
        lat: -8.658463448940344,
        lng: 125.90459808876005,
        ruName: "Восточный Тимор",
    },
    "New Caledonia": {
        lat: -21.313570537463495,
        lng: 165.39279025804234,
        ruName: "Новая Каледония",
    },
    Fiji: {
        lat: -17.78661923637955,
        lng: 177.95245065924647,
        ruName: "Фиджи",
    },
    "Brunei Darussalam": {
        lat: 4.5063386221394826,
        lng: 114.64160024988739,
        ruName: "Бруней",
    },
    Afghanistan: {
        lat: 33.875308320987045,
        lng: 65.03167973832738,
        ruName: "Афганистан",
    },
    Angola: {
        lat: -12.30691229107682,
        lng: 17.6921566959402,
        ruName: "Ангола",
    },
    Albania: {
        lat: 41.04117103262915,
        lng: 20.07876719742526,
        ruName: "Албания",
    },
    "United Arab Emirates": {
        lat: 23.768052295037,
        lng: 53.999559691376135,
        ruName: "Объединенные Арабские Эмираты",
    },
    Argentina: {
        lat: -35.1496062243375,
        lng: -66.61212248867075,
        ruName: "Аргентина",
    },
    Armenia: {
        lat: 40.28556186170698,
        lng: 44.65551944360328,
        ruName: "Армения",
    },
    "French Southern and Antarctic Lands": {
        lat: -49.29930750834638,
        lng: 69.45523162434942,
        ruName: "Французские Южные и Антарктические Территории",
    },
    Austria: {
        lat: 47.58464065567376,
        lng: 14.288574249898515,
        ruName: "Австрия",
    },
    Azerbaijan: {
        lat: 40.3778996415051,
        lng: 47.968064934923724,
        ruName: "Азербайджан",
    },
    Burundi: {
        lat: -3.3097892933412383,
        lng: 29.92776281910503,
        ruName: "Бурунди",
    },
    Belgium: {
        lat: 50.49738153797359,
        lng: 4.633360681440723,
        ruName: "Бельгия",
    },
    Benin: {
        lat: 9.601050901838638,
        lng: 2.414777456170408,
        ruName: "Бенин",
    },
    "Burkina Faso": {
        lat: 12.25606574532144,
        lng: -1.7346105967386904,
        ruName: "Буркина-Фасо",
    },
    Bangladesh: {
        lat: 24.177734397361245,
        lng: 90.35145516958052,
        ruName: "Бангладеш",
    },
    Bulgaria: {
        lat: 42.50708684054125,
        lng: 25.300650475775356,
        ruName: "Болгария",
    },
    Bahamas: {
        lat: 24.71123112990812,
        lng: -78.05796033152824,
        ruName: "Багамы",
    },
    "Bosnia and Herzegovina": {
        lat: 44.629071870595,
        lng: 17.785410157134123,
        ruName: "Босния и Герцеговина",
    },
    Belarus: {
        lat: 53.21021922016553,
        lng: 28.009095223860246,
        ruName: "Беларусь",
    },
    Belize: {
        lat: 16.792477692423976,
        lng: -88.7443616109321,
        ruName: "Белиз",
    },
    Bolivia: {
        lat: -16.765229041051104,
        lng: -64.75528948930175,
        ruName: "Боливия",
    },
    Brazil: {
        lat: -8.326491635673237,
        lng: -56.197873450699,
        ruName: "Бразилия",
    },
    Bhutan: {
        lat: 27.40458019242556,
        lng: 90.41765218861619,
        ruName: "Бутан",
    },
    Botswana: {
        lat: -22.167761678979087,
        lng: 23.728023680595935,
        ruName: "Ботсвана",
    },
    "Central African Republic": {
        lat: 6.5941556823449305,
        lng: 20.498224923232254,
        ruName: "Центральноафриканская Республика",
    },
    Canada: {
        lat: 57.77585623432339,
        lng: -101.3686130345947,
        ruName: "Канада",
    },
    Switzerland: {
        lat: 46.799622578300685,
        lng: 8.009535192636676,
        ruName: "Швейцария",
    },
    Chile: {
        lat: -26.722158612590928,
        lng: -70.47884054887143,
        ruName: "Чили",
    },
    China: {
        lat: 34.6717105551933,
        lng: 103.66872548387443,
        ruName: "Китай",
    },
    "Côte d'Ivoire": {
        lat: 7.7091147414165055,
        lng: -5.409221227028002,
        ruName: "Кот-д'Ивуар",
    },
    Cameroon: {
        lat: 5.591847740923109,
        lng: 12.79965624331502,
        ruName: "Камерун",
    },
    "Democratic Republic of the Congo": {
        lat: -2.79482000667889,
        lng: 23.54417093752363,
        ruName: "Демократическая Республика Конго",
    },
    "Republic of Congo": {
        lat: -0.8473656287166798,
        lng: 15.35628539191016,
        ruName: "Республика Конго",
    },
    "Costa Rica": {
        lat: 10.40849008419816,
        lng: -84.26381637202263,
        ruName: "Коста-Рика",
    },
    Cuba: {
        lat: 21.57616282422012,
        lng: -78.9847298593857,
        ruName: "Куба",
    },
    "Northern Cyprus": {
        lat: 35.25087588648117,
        lng: 33.65732984533183,
        ruName: "Северный Кипр",
    },
    Cyprus: {
        lat: 35.0456716708995,
        lng: 33.22450674413433,
        ruName: "Кипр",
    },
    "Czech Republic": {
        lat: 49.687814186921884,
        lng: 15.115060765459807,
        ruName: "Чехия",
    },
    Germany: {
        lat: 51.056402760939214,
        lng: 10.230718971032013,
        ruName: "Германия",
    },
    Djibouti: {
        lat: 11.745343358528256,
        lng: 42.58319180046818,
        ruName: "Джибути",
    },
    Denmark: {
        lat: 55.4926247680949,
        lng: 10.157018917095188,
        ruName: "Дания",
    },
    "Dominican Republic": {
        lat: 18.904501394436316,
        lng: -70.20241938306927,
        ruName: "Доминиканская Республика",
    },
    Algeria: {
        lat: 28.111134067835746,
        lng: 2.646604301208949,
        ruName: "Алжир",
    },
    Ecuador: {
        lat: -1.4423353199647,
        lng: -78.53418797698009,
        ruName: "Эквадор",
    },
    Egypt: {
        lat: 26.728688847530364,
        lng: 29.783898029831235,
        ruName: "Египет",
    },
    Eritrea: {
        lat: 15.235734489984063,
        lng: 38.36680212075668,
        ruName: "Эритрея",
    },
    Spain: {
        lat: 40.26743638103257,
        lng: -3.693065325127491,
        ruName: "Испания",
    },
    Estonia: {
        lat: 58.66814915712467,
        lng: 25.531931117622746,
        ruName: "Эстония",
    },
    Ethiopia: {
        lat: 9.144514760366522,
        lng: 39.03487986519832,
        ruName: "Эфиопия",
    },
    Finland: {
        lat: 63.24671762536039,
        lng: 25.92057080881081,
        ruName: "Финляндия",
    },
    "Falkland Islands": {
        lat: -51.76777268008877,
        lng: -59.15907599355303,
        ruName: "Фолклендские острова",
    },
    France: {
        lat: 46.73561235188521,
        lng: 2.5316165398155673,
        ruName: "Франция",
    },
    Gabon: {
        lat: -0.4970962914048602,
        lng: 11.774848551943273,
        ruName: "Габон",
    },
    "United Kingdom": {
        lat: 54.219123515520995,
        lng: -3.452335780439261,
        ruName: "Соединенное Королевство",
    },
    Georgia: {
        lat: 42.15759073347299,
        lng: 43.45147724207119,
        ruName: "Грузия",
    },
    Ghana: {
        lat: 7.004977942284062,
        lng: -1.202369158153788,
        ruName: "Гана",
    },
    "Guinea-Bissau": {
        lat: 10.502207737727932,
        lng: -10.438186919208812,
        ruName: "Гвинея",
    },
    Gambia: {
        lat: 13.442559789267347,
        lng: -15.490699115685898,
        ruName: "Гамбия",
    },
    GuineaBissau: {
        lat: 11.868483841945163,
        lng: -15.587655551265405,
        ruName: "Гвинея-Бисау",
    },
    "Equatorial Guinea": {
        lat: 1.6867643620045285,
        lng: 10.314553062911388,
        ruName: "Экваториальная Гвинея",
    },
    Greece: {
        lat: 39.01942401470699,
        lng: 21.753248249431573,
        ruName: "Греция",
    },
    Greenland: {
        lat: 71.53471413524534,
        lng: -42.60547698511304,
        ruName: "Гренландия",
    },
    Guatemala: {
        lat: 15.69337662291328,
        lng: -90.33451436564248,
        ruName: "Гватемала",
    },
    Guyana: {
        lat: 4.843929542422753,
        lng: -58.967990980754755,
        ruName: "Гайана",
    },
    Honduras: {
        lat: 14.73555616846926,
        lng: -86.94189420460932,
        ruName: "Гондурас",
    },
    Croatia: {
        lat: 45.10044303016205,
        lng: 15.004826054590388,
        ruName: "Хорватия",
    },
    Haiti: {
        lat: 18.91133691399144,
        lng: -72.34063323190745,
        ruName: "Гаити",
    },
    Hungary: {
        lat: 47.18163189838219,
        lng: 19.39494777316411,
        ruName: "Венгрия",
    },
    India: {
        lat: 20.593684708619393,
        lng: 78.96287991935549,
        ruName: "Индия",
    },
    "Ireland (Eire)": {
        lat: 53.175448312209265,
        lng: -7.759433944689285,
        ruName: "Ирландия",
    },
    Iran: {
        lat: 32.156881320808004,
        lng: 54.32110005326245,
        ruName: "Иран",
    },
    Iraq: {
        lat: 33.230010159573754,
        lng: 42.94408275168899,
        ruName: "Ирак",
    },
    Iceland: {
        lat: 64.9841688950677,
        lng: -18.10578752365167,
        ruName: "Исландия",
    },
    Israel: {
        lat: 31.41313459131533,
        lng: 35.02027432443872,
        ruName: "Израиль",
    },
    Italy: {
        lat: 42.83741885691137,
        lng: 12.40717154640647,
        ruName: "Италия",
    },
    Jamaica: {
        lat: 18.13773061309569,
        lng: -77.30691397898353,
        ruName: "Ямайка",
    },
    Jordan: {
        lat: 31.15670960754723,
        lng: 36.961967785003174,
        ruName: "Иордания",
    },
    Japan: {
        lat: 36.50953361132796,
        lng: 137.64842328443413,
        ruName: "Япония",
    },
    Kazakhstan: {
        lat: 48.42250490374044,
        lng: 66.8479709792171,
        ruName: "Казахстан",
    },
    Kenya: {
        lat: -0.1409508916534331,
        lng: 37.58008160232918,
        ruName: "Кения",
    },
    Kyrgyzstan: {
        lat: 41.35733450904198,
        lng: 74.35314207390937,
        ruName: "Киргизия",
    },
    Cambodia: {
        lat: 12.565568671383738,
        lng: 104.99030802438326,
        ruName: "Камбоджа",
    },
    "South Korea": {
        lat: 35.83981561868369,
        lng: 127.03427724926658,
        ruName: "Южная Корея",
    },
    Kosovo: {
        lat: 42.58415067527852,
        lng: 20.90588573872823,
        ruName: "Косово",
    },
    Kuwait: {
        lat: 29.375596271321473,
        lng: 47.486160686203464,
        ruName: "Кувейт",
    },
    Laos: {
        lat: 19.856270783916566,
        lng: 102.49549647114444,
        ruName: "Лаос",
    },
    Lebanon: {
        lat: 33.896329364876185,
        lng: 35.870218964100205,
        ruName: "Ливан",
    },
    Liberia: {
        lat: 6.365509378444647,
        lng: -9.339992262793766,
        ruName: "Либерия",
    },
    Libya: {
        lat: 26.26955551505538,
        lng: 17.2137855623597,
        ruName: "Ливия",
    },
    "Sri Lanka": {
        lat: 7.568848151992657,
        lng: 80.79982543616928,
        ruName: "Шри-Ланка",
    },
    Lesotho: {
        lat: -29.590925492659366,
        lng: 28.243947240398923,
        ruName: "Лесото",
    },
    Lithuania: {
        lat: 55.22308192143123,
        lng: 24.58089997823679,
        ruName: "Литва",
    },
    Luxembourg: {
        lat: 49.77290725497788,
        lng: 6.088662700764442,
        ruName: "Люксембург",
    },
    Latvia: {
        lat: 56.84598142748824,
        lng: 24.948160225231445,
        ruName: "Латвия",
    },
    Morocco: {
        lat: 31.546915924762276,
        lng: -6.59162186918156,
        ruName: "Марокко",
    },
    Moldova: {
        lat: 47.212924133067,
        lng: 28.36925054727107,
        ruName: "Молдова",
    },
    Madagascar: {
        lat: -19.13084498645324,
        lng: 46.85389675937656,
        ruName: "Мадагаскар",
    },
    Mexico: {
        lat: 22.543335140432494,
        lng: -102.6553315369737,
        ruName: "Мексика",
    },
    Macedonia: {
        lat: 41.58227052882265,
        lng: 21.74692829989852,
        ruName: "Северная Македония",
    },
    Mali: {
        lat: 17.556492664787105,
        lng: -3.9285621254148266,
        ruName: "Мали",
    },
    Myanmar: {
        lat: 21.176174581116823,
        lng: 96.82744086534317,
        ruName: "Мьянма",
    },
    Montenegro: {
        lat: 42.78002721816678,
        lng: 19.363893816872907,
        ruName: "Черногория",
    },
    Mongolia: {
        lat: 46.82503826903603,
        lng: 103.9279273953494,
        ruName: "Монголия",
    },
    Mozambique: {
        lat: -18.824262965097973,
        lng: 35.29360252685097,
        ruName: "Мозамбик",
    },
    Mauritania: {
        lat: 20.25462506710483,
        lng: -10.34925794057323,
        ruName: "Мавритания",
    },
    Malawi: {
        lat: -13.219163441704814,
        lng: 34.31455306291139,
        ruName: "Малави",
    },
    Namibia: {
        lat: -22.55972221776419,
        lng: 17.08349190318459,
        ruName: "Намибия",
    },
    Niger: {
        lat: 17.3233671701413,
        lng: 9.64261507698179,
        ruName: "Нигер",
    },
    Nigeria: {
        lat: 9.59605711244045,
        lng: 8.092181282233567,
        ruName: "Нигерия",
    },
    Nicaragua: {
        lat: 12.847460224713628,
        lng: -85.0912721403197,
        ruName: "Никарагуа",
    },
    Netherlands: {
        lat: 52.108882052182556,
        lng: 5.330107873065,
        ruName: "Нидерланды",
    },
    Norway: {
        lat: 60.73660782037069,
        lng: 8.59548018807909,
        ruName: "Норвегия",
    },
    Nepal: {
        lat: 28.171138112899784,
        lng: 83.75504046469409,
        ruName: "Непал",
    },
    Oman: {
        lat: 21.442982776019775,
        lng: 57.516579980754765,
        ruName: "Оман",
    },
    Pakistan: {
        lat: 30.276815361725695,
        lng: 69.63594686784915,
        ruName: "Пакистан",
    },
    Panama: {
        lat: 8.42537266088041,
        lng: -80.12025281236702,
        ruName: "Панама",
    },
    Peru: {
        lat: -9.190980638907768,
        lng: -75.01515281236702,
        ruName: "Перу",
    },
    PapuaNewGuinea: {
        lat: -6.693873634758651,
        lng: 145.26890706244605,
        ruName: "Папуа Новая Гвинея",
    },
    Poland: {
        lat: 51.89680181684456,
        lng: 18.622392918024005,
        ruName: "Польша",
    },
    "Puerto Rico": {
        lat: 18.155120887308207,
        lng: -66.1269684637324,
        ruName: "Пуэрто-Рико",
    },
    "North Korea": {
        lat: 40.24491430976386,
        lng: 127.04606870426171,
        ruName: "Северная Корея",
    },
    Portugal: {
        lat: 38.82943688813988,
        lng: -8.0208589798027,
        ruName: "Португалия",
    },
    Paraguay: {
        lat: -23.308966044505057,
        lng: -58.0786746347078,
        ruName: "Парагвай",
    },
    Qatar: {
        lat: 25.254710432844235,
        lng: 51.1981984798471,
        ruName: "Катар",
    },
    Romania: {
        lat: 45.97994684723445,
        lng: 24.000011964450238,
        ruName: "Румыния",
    },
    "Russian Federation": {
        lat: 61.9286427423236,
        lng: 100.32311636484335,
        ruName: "Россия",
    },
    Rwanda: {
        lat: -2.081848697928447,
        lng: 29.5876828206695,
        ruName: "Руанда",
    },
    "Saudi Arabia": {
        lat: 24.178081994348392,
        lng: 44.2317540029781,
        ruName: "Саудовская Аравия",
    },
    Sudan: {
        lat: 14.853791531230218,
        lng: 30.219915407304986,
        ruName: "Судан",
    },
    "South Sudan": {
        lat: 7.257004233381551,
        lng: 30.0999263651518,
        ruName: "Южный Судан",
    },
    Senegal: {
        lat: 14.496788282242284,
        lng: -14.438401097987684,
        ruName: "Сенегал",
    },
    "Solomon Islands": {
        lat: -9.4095576093168,
        lng: 159.02697030872677,
        ruName: "Соломоновы острова",
    },
    "Sierra Leone": {
        lat: 8.348704521479597,
        lng: -11.67987083027032,
        ruName: "Сьерра-Леоне",
    },
    "El Salvador": {
        lat: 13.719892060034374,
        lng: -89.16633548784668,
        ruName: "Сальвадор",
    },
    Somaliland: {
        lat: 9.43282228494984,
        lng: 45.96430802438327,
        ruName: "Сомалиленд",
    },
    Somalia: {
        lat: 5.927803404417193,
        lng: 47.77896615815382,
        ruName: "Сомали",
    },
    "Republic of Serbia": {
        lat: 44.02014827172562,
        lng: 20.90831521850313,
        ruName: "Сербия",
    },
    Suriname: {
        lat: 4.374887234308132,
        lng: -56.023784688446394,
        ruName: "Суринам",
    },
    Slovakia: {
        lat: 48.70706919766847,
        lng: 19.56895424989852,
        ruName: "Словакия",
    },
    Slovenia: {
        lat: 46.157286244790046,
        lng: 14.673291769207216,
        ruName: "Словения",
    },
    Sweden: {
        lat: 60.60370612379857,
        lng: 15.628308879090059,
        ruName: "Швеция",
    },
    Swaziland: {
        lat: -26.51527093662506,
        lng: 31.48030518099153,
        ruName: "Свазиленд",
    },
    Syria: {
        lat: 34.72743180659041,
        lng: 38.156348351840154,
        ruName: "Сирия",
    },
    Chad: {
        lat: 15.5440318403861,
        lng: 18.732881116307927,
        ruName: "Чад",
    },
    Togo: {
        lat: 8.547112511738464,
        lng: 0.9878064646940978,
        ruName: "Того",
    },
    Thailand: {
        lat: 15.870032849968339,
        lng: 100.9922258411699,
        ruName: "Таиланд",
    },
    Tajikistan: {
        lat: 38.59200328987738,
        lng: 68.75349767411154,
        ruName: "Таджикистан",
    },
    Turkmenistan: {
        lat: 38.96999754765402,
        lng: 58.15215694057323,
        ruName: "Туркменистан",
    },
    "East Timor": {
        lat: -8.866573147400613,
        lng: 126.41301159304243,
        ruName: "Восточный Тимор",
    },
    "Trinidad and Tobago": {
        lat: 10.394387951117957,
        lng: -61.299626968463734,
        ruName: "Тринидад и Тобаго",
    },
    Tunisia: {
        lat: 33.80045861143544,
        lng: 9.697478729121042,
        ruName: "Тунис",
    },
    Turkey: {
        lat: 38.903565240642105,
        lng: 35.42782474528923,
        ruName: "Турция",
    },
    Taiwan: {
        lat: 23.798635299330755,
        lng: 120.98005537750286,
        ruName: "Тайвань",
    },
    Tanzania: {
        lat: -6.373514745058179,
        lng: 34.88521441415424,
        ruName: "Танзания",
    },
    Uganda: {
        lat: 1.346843007637932,
        lng: 32.31522771816597,
        ruName: "Уганда",
    },
    Ukraine: {
        lat: 48.38035128644933,
        lng: 31.16519803152363,
        ruName: "Украина",
    },
    Uruguay: {
        lat: -32.79996811578317,
        lng: -56.01410987849782,
        ruName: "Уругвай",
    },
    Uzbekistan: {
        lat: 41.297169874320475,
        lng: 63.282776086056754,
        ruName: "Узбекистан",
    },
    Venezuela: {
        lat: 6.423750722334855,
        lng: -66.58978565864235,
        ruName: "Венесуэла",
    },
    Vietnam: {
        lat: 14.002233302179935,
        lng: 108.39202890283505,
        ruName: "Вьетнам",
    },
    Vanuatu: {
        lat: -16.52791135135838,
        lng: 167.4208340584267,
        ruName: "Вануату",
    },
    "West Bank": {
        lat: 31.946238528415336,
        lng: 35.30284648672221,
        ruName: "Западный берег реки Иордан",
    },
    Yemen: {
        lat: 15.55277411742627,
        lng: 48.516113372503874,
        ruName: "Йемен",
    },
    "South Africa": {
        lat: -29.061098867759463,
        lng: 24.96441308379065,
        ruName: "Южно-Африканская Республика",
    },
    Zambia: {
        lat: -13.406596811056073,
        lng: 27.855900702329178,
        ruName: "Замбия",
    },
    Zimbabwe: {
        lat: -19.01148534878132,
        lng: 29.147199937963135,
        ruName: "Зимбабве",
    },
};

export default countries;
